Autodesk.Revit.DB.Electrical.TemperatureRating.GetTemperatureRatings(Autodesk.Revit.DB.Document)
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2026

Autodesk.Revit.DB.Electrical.TemperatureRating.GetTemperatureRatingIdByName(Autodesk.Revit.DB.Document,System.String)
Gets the Conductor Temperature Rating id by given Conductor Temperature Rating name.
document:
The document.
name:
The Conductor Temperature Rating name.
Returns:
The Conductor Temperature Rating id.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
-or-
name cannot include prohibited characters, such as "{, }, [, ], |, ;, less-than sign, greater-than sign, ?, `, ~".
-or-
name is an empty string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
Since:
2026

Autodesk.Revit.DB.Electrical.TemperatureRating.GetTemperatureRatingIds(Autodesk.Revit.DB.Document)
Gets all the Conductor Temperature Rating ids in the given document, sorted by name.
document:
The document.
Returns:
All the Conductor Temperature Rating ids in this document.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
Since:
2026

Autodesk.Revit.DB.Electrical.TemperatureRating.GetTemperatureRating(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Gets the Conductor Temperature Rating data by given Conductor Temperature Rating id.
document:
The document.
temperatureRatingId:
The Conductor Temperature Rating id.
Returns:
The Conductor Temperature Rating data.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
-or-
The id is not a Conductor Temperature Rating id.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
Since:
2026

Autodesk.Revit.DB.Electrical.TemperatureRating.Create(Autodesk.Revit.DB.Document)
Creates a Conductor Temperature Rating.
document:
The document.
Returns:
The newly created Conductor Temperature Rating data.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2026

Autodesk.Revit.DB.Electrical.TemperatureRating.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Electrical.TemperatureRating.Name
The Conductor Temperature Rating name.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: name is an empty string or contains only whitespace.
-or-
When setting this property: name cannot include prohibited characters, such as "{, }, [, ], |, ;, less-than sign, greater-than sign, ?, `, ~".
-or-
When setting this property: name is not unique in document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2026

Autodesk.Revit.DB.Electrical.TemperatureRating.Id
The Conductor Temperature Rating id.
Since:
2026

Autodesk.Revit.DB.Electrical.TemperatureRating
This class represents the definition of Conductor Temperature Rating data.
Since:
2026